html/system-objet.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Utilisation d'un système orienté objets</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-02-02 15:25:56 EST"/>
<meta name="author" content=""/>
<link rel="stylesheet" type="text/css" href="style.css" />
</head><body>
<h1 class="title">Utilisation d'un système orienté objets</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Besoins </a></li>
<li><a href="#sec-2">2 Essaie d'implémentations existantes </a></li>
<li><a href="#sec-3">3 Écriture </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Besoins </h2>
<div id="text-1">


<p>
Le besoin d'avoir un système orienté objet s'est fait rapidement
sentir lorsque space-invaders a été developpé. Entre autre, la
version initiale effectué de manière manuelle du "double dispatch",
ce qui est laborieux et pénible à écrire.
</p>
<p>
De plus, la nature des objets du jeux faisaient en sorte que
plusieurs champs pouvaient être hérités.
</p>
<p>
Afin que le système d'objets puisse être utilisé dans le jeu, le
coût associé à son utilisation doit être faible, afin de ne pas
ralentir la cadence du jeux.
</p>
<p>
Aussi, une interface à la CLOS semblait être une bonne approche,
tant parce que CLOS est un système connu (donc facile à utiliser)
qui a fait ses preuves et parce que le principe de fonction
génériques semble mieux adapté à un système ayant des fonctions de
premières classes, puisqu'en utilisant des fonctions génériques,
celle-ci peuvent être utilisées avec des fonctions d'ordre supérieur
très facilement.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Essaie d'implémentations existantes <span class="timestamp">2008-08-15 Fri</span> </h2>
<div id="text-2">


<p>
Au départ, j'ai voulu utiliser des systèmes objets déjà existant
afin de ne pas perdre de temps. Ainsi, le système objets nommé
"oops" semblait un bon candidat, puisque ce dernier possédait
plusieurs "features" intéressantes comme l'héritage multiple et le
dispatch multiple. 
</p>
<p>
Après avoir réussi à intégrer ce système au jeu, des performances
pitoyables ont été observées. En effet, après avoir discuter avec
l'auteur du système, il m'a avoué que le système avait été écrit
sans soucis réel des performances. Ce fut donc un échec, mais le
code écrit semblait beaucoup plus élégant que la version "manuelle"
précédente.
</p>
<p>
Par la suite, nous avons regardé le système objet nommé Meroon. Ce
dernier semblait plus efficace, mais il paraissait plus limité en
terme de possibilité. Entre autre, il n'y avait pas d'héritage
multiple de permis. Aussi, il n'était pas possible d'avoir des
champs de classes statiques (communs à toutes les instances). Et
donc, nous n'avons pas voulu nous limiter nos possibilitées à cause
des choix fait par un autre développeur. C'est là que nous est venu
le besoin d'écrire nous même notre propre système, qui pourrait donc
être moulé directement à nos besoins.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Écriture <span class="timestamp">2008-10-15 Wed</span> </h2>
<div id="text-3">


<p>
Après l'identification des besoins du système objets:
</p>
<ul>
<li>
Rapidité d'accès aux champs
</li>
<li>
Rapidité de dispatch multiple
</li>
<li>
Héritage multiple et polymorphisme
</li>
<li>
Champs statiques
</li>
<li>
blabla

</li>
</ul>

<p>L'écriture du système comme tel a débuté. Le developpement des
fonctionnalités principales a pris beaucoup moins de temps que je ne
l'aurais cru possible. Après environ deux semaines, nous avions déjà
des instances de classes effectuant de l'héritage et un certain
degré de polymorphisme (accès aux champs).
</p>
<p>
blabla
</p></div>
</div>
<div id="postamble"><p class="author"> Author: 
<a href="mailto:dave@david-laptop">&lt;dave@david-laptop&gt;</a>
</p>
<p class="date"> Date: 2009-02-02 15:25:56 EST</p>
<p>HTML generated by org-mode 6.21a in emacs 22</p>
</div></body>
</html>
